i-contact/app/controllers/locations_controller.rb

def show
  # @user = User.find(params[:id])
  @location = Location.all
---
SELECT "locations".* FROM "locations"

def create
  user = User.find(params[:user_id])
  location = Location.where(user_id: user)
  if location.length > 0
    Location.update(location.last.id, location_params)
      ActionCable.server.broadcast 'locations_channel',
       lat: location.last.lat,
       lng: location.last.lng,
       user: location.last.user
       render json: @location, status: :ok
     head :ok
 else
   location = Location.new(location_params)
   user.locations << location
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "locations".* FROM "locations"
INSERT INTO "locations" ("user_id", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["lat", "40.7398046"], ["lng", "-73.9896319"], ["created_at", "2019-04-10 17:54:41.006905"], ["updated_at", "2019-04-10 17:54:41.006905"]]

 def destroy
   user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]