i-contact/app/controllers/meetings_controller.rb

def index
  @meeting = Meeting.all
---
SELECT "meetings".* FROM "meetings"

  def create
    @meeting = Meeting.new(meeting_params)
    @meeting.save!
---
INSERT INTO "meetings" ("is_occur", "user_id", "review_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["is_occur", true], ["user_id", 1], ["review_id", 1], ["created_at", "2019-04-09 23:34:47.623271"], ["updated_at", "2019-04-09 23:34:47.623271"]]