i-contact/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_diagest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "bruno"], ["email", "bruno@gmail.com"], ["password_diagest", "gaga"], ["created_at", "2019-04-08 19:10:42.611205"], ["updated_at", "2019-04-08 19:10:42.611205"]]
---
  def create
    @user = User.new(user_params)
# need to solve the the issue that im passing pass_diagest to my db (maybe it's here)
    if @user.save