i-contact/app/channels/locations_channel.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def subscribed
     stream_from 'locations_channel'
     @location = Location.find_by(id: params[:markers])